dia0 e dia1 revisado
